12/data/attachments/fe9ff7639d8c3392.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_7517b9fd-d6d3-4a46-9355-acf0c1718140</nif:username>
            <nif:friendToBeAdded>Kimberly_talk_Friend_24086_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>